---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.GetBoundarySize
source: html/9620fd63-46c2-d123-817d-630acc21fbb1.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.GetBoundarySize Method

Returns size of the section boundary.

## Syntax (C#)
```csharp
public UV GetBoundarySize()
```

## Returns
Size of the section boundary.